[
    { "id":"1",
      "instructor": "Jhankar Mahbub",
      "course_img": "https://www.programming-hero.com/blog/assets/images/blog/python-developer-roadmap-follow-this-roadmap-and-become-a-python-hero.png",
      "instructor_img":"https://www.tbsnews.net/sites/default/files/styles/infograph/public/images/2021/07/08/img_2842_0.jpg?itok=G1cRamCf&timestamp=1625721391",
      "title":"Python Dev Road-map",
      "topic":"Python Iterator, Python Generator, Python Closure, Python Decorators, Python Property, Python RegEx, Python Examples.",
      "description":"Includes procedural and data abstractions, program design, debugging, testing, and documentation. Covers data types, control structures, functions, parameter passing, library functions, arrays, inheritance and object oriented design. Laboratory exercises in Python.",
      "duration":"2 Months",
      "lecture_quantity":"10"
    },
    { "id":"2",
      "instructor": "Anisul Islam",
      "course_img": "https://img.freepik.com/free-vector/digital-coding-background-with-numbers-zero-one_1017-30363.jpg?w=1380&t=st=1659072286~exp=1659072886~hmac=897743b2a620b4b86e91ebe31746ff5d1066789e1919f3f96b1a110a3c5fb2b3",
      "instructor_img":"https://avatars.githubusercontent.com/u/28184926?v=4",
      "title":"Structure Programming Language (C)",
      "topic":"C Programming Pointers. C Pointers & Arrays. C Pointers And Functions. C Memory Allocation.",
      "description":"C is an imperative procedural language supporting structured programming, lexical variable scope, and recursion, with a static type system. It was designed to be compiled to provide low-level access to memory and language constructs that map efficiently to machine instructions, all with minimal runtime support.",
      "duration":"2 Months",
      "lecture_quantity":"10"
    },
    { "id":"3",
      "instructor": "Tamim shahriar subeen",
      "course_img": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20220509120600/Learn-Data-Structures-and-Algorithms-Easily.gif",
      "instructor_img":"https://avatars.githubusercontent.com/u/1166111?v=4",
      "title":"Data structures & Algorithms with C++",
      "topic":"Basic C++, Array, Function, Linked List, Stack, Queue, Tree, Graph,Searches, Sorts etc ",
      "description":"This course teaches learners how to write a program in the C++ language, including how to set up a development environment for writing and debugging C++ code and how to implement data structures as C++ classes.",
      "duration":"2 Months",
      "lecture_quantity":""
    },
    { "id":"4",
      "instructor": "Rakib Hasan",
      "course_img": "https://img.freepik.com/free-photo/java-computer-screen-with-elements-program-code-3d_327483-680.jpg?w=2000",
      "instructor_img":"https://userphotos2.teacheron.com/1110440-01787.jpg",
      "title":"OOP with Java",
      "topic":"Abstraction, Using simple things to represent complexity, Encapsulation, Inheritance, Polymorphism.",
      "description":"The course focuses on the understanding and practical mastery of object-oriented concepts such as classes, objects, data abstraction, methods, method overloading, inheritance and polymorphism. Practical applications in the domain of data science and as seen in stacks, queues, lists, and trees will be examined.",
      "duration":"2 Months",
      "lecture_quantity":"10"
    },
    { "id":"5",
      "instructor": "Javin Paul",
      "course_img": "https://a0.awsstatic.com/libra-css/images/logos/aws_logo_smile_1200x630.png",
      "instructor_img":"https://pbs.twimg.com/profile_images/452445450168049664/2wQFtkf9_400x400.jpeg",
      "title":"AWS Cloud service",
      "topic":"Classic Data Center. Virtualization. Cloud and Cloud Computing. Cloud Computing Service Models. Cloud Computing Deployment Models. Service Comparison: AWS, Azure, and GCP. Amazon Web Services (AWS) and its Benefits. AWS Global Infrastructure.",
      "description":"the basic global infrastructure of the AWS Cloud. Explain the six main benefits of the AWS Cloud. Describe and provide an example of the core AWS services, including compute, network, database, and storage services. Identify an appropriate solution using AWS Cloud services for various use",
      "duration":"3 Months",
      "lecture_quantity":"10"
    },
    { "id":"6",
      "instructor": "Jhankar Mahbub",
      "course_img": "https://webimages.mongodb.com/_com_assets/cms/kuzt9r42or1fxvlq2-Meta_Generic.png",
      "instructor_img":"https://images.gr-assets.com/authors/1456905354p8/15050617.jpg",
      "title":"NoSQL MongoDB ",
      "topic":"Documents: The Records in a Document Database. Collections: Grouping Documents. Replica Sets: Ensuring High Availability. Sharding: Scalability to Handle Massive Data Growth. Indexes: Improving Query Speed. Aggregation Pipelines: Fast Data Flows.",
      "description":"You will gain knowledge in mastering data modelling, ingestion, query and Sharding, and much more, to become job ready. The MongoDB full course covers a range of NoSQL and MongoDB® topics which will help you gain various development, administering, and engineering skills.",
      "duration":"2 Months",
      "lecture_quantity":"10"
    }
    
  ]
